Can't create a single Pad with several connected regions.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId BuildingPadNotConnected { get; }
  Visual Basic
Public Shared ReadOnly Property BuildingPadNotConnected As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ BuildingPadNotConnected {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SiteFailures Class
  Autodesk.Revit.DB Namespace